{
	"errors": {
		"EM-000": "An unknown error occurred. Please try again later.",
		"EM-001": "An upstream service is not available. Please try again later.",
		"EM-002": "An unknown server error occurred. Please try again later.",
		"EM-003": "The requested resource does not exist. Please check the URL.",
		"EM-004": "The request could not be completed due to a conflict with the current state of the resource. Contact the support team for help.",
		"EM-005": "The request could not be completed due to a bad request. Contact the support team for help.",
		"EM-006": "The authentication token used to access the resource is invalid or expired. You are now getting redirected to the login page.",
		"EM-007": "The provided password is incorrect. Please try again.",
		"EM-008": "The request could not be completed due to insufficient permissions of the authenticated user.",
		"EM-009": "No user was found with the provided email address. Please check the email address and try again.",
		"EM-010": "The targeted trip does not exist or you do not have sufficient permissions to access the resource.",
		"EM-011": "The targeted cost item does not exist or you do not have sufficient permissions to access the resource.",
		"EM-012": "The registration failed since the email or username you provided is already in use.",
		"EM-013": "Your account is not activated yet. Please check your emails and enter the activation code by pressing on the button next to this message.",
		"EM-014": "The request was processed successfully, but an email could not be sent.",
		"EM-015": "Your account is already activated. Please log in.",
		"EM-016": "You already accepted the invitation to this trip.",
		"EM-017": "The email you provided is already in use.",
		"EM-018": "The username you provided is already in use."
	},
	"header": {
		"languages": {
			"en": "English",
			"de": "German"
		},
		"logout": "Logout",
		"search": "Search trips..."
	},
	"footer": {
		"followUs": {
			"title": "Follow us"
		},
		"legal": {
			"title": "Legal",
			"imprint": "Imprint"
		},
		"imprint": {
			"title": "Imprint",
			"close": "Close",
			"general": {
				"title": "General",
				"content": "Information according to § 5 TMG",
				"name": "Kevin Kemal Rieger",
				"address": "Schulzenstraße 4, 68259 Mannheim"
			},
			"represented_by": {
				"title": "Represented by",
				"name": "Kevin Kemal Rieger"
			},
			"contact": {
				"title": "Contact",
				"phone": "Phone",
				"phone_number": "+49 152 09707882",
				"email": "Email",
				"email_address": "team@mail.costventures.works"
			},
			"disclaimer": {
				"title": "Disclaimer",
				"content_1": "Liability for content",
				"content_1_description": "The content of our pages has been created with the utmost care. However, we cannot guarantee the accuracy, completeness, and timeliness of the content. As a service provider, we are responsible for our own content on these pages according to § 7 para. 1 TMG (German Telemedia Act) and general laws. According to §§ 8 to 10 TMG, we are not obliged to monitor transmitted or stored third-party information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information according to general laws remain unaffected. However, liability in this regard is only possible from the time we become aware of a specific infringement. Upon becoming aware of such legal violations, we will promptly remove the content.",
				"content_2": "Liability for links",
				"content_2_description": "Our offer contains links to external websites of third parties over whose content we have no influence. Therefore, we cannot assume any liability for these external contents. The respective provider or operator of the linked pages is always responsible for their content. The linked pages were checked for possible legal violations at the time of linking. No illegal content was discernible at the time of linking. However, a permanent content control of the linked pages is not reasonable without concrete evidence of an infringement. If we become aware of any legal violations, we will remove such links immediately.",
				"content_3": "Data protection",
				"content_3_description": "The use of our website is generally possible without providing personal data. If personal data (e.g., name, address, or email addresses) is collected on our website, it is always done on a voluntary basis, if possible. This data will not be disclosed to third parties without your explicit consent. We would like to point out that data transmission over the Internet (e.g., communication by email) can have security vulnerabilities. Complete protection of data against access by third parties is not possible. The use of contact data published within the framework of the imprint obligation by third parties for sending unsolicited advertising and information materials is hereby expressly prohibited. The operators of the pages expressly reserve the right to take legal action in the event of unsolicited sending of promotional information, such as spam emails."
			}
		}
	},
	"forms": {
		"step": "Step",
		"signup": {
			"title": "Sign up",
			"steps": {
				"email": {
					"title": "Select your email",
					"invalidEmail": "Please provide a valid email",
					"validEmail": "Email is valid",
					"initialValidation": "Please provide a valid email address to check availability",
					"ongoingValidation": "Checking availability...",
					"available": "This email is available",
					"unavailable": "This email is already taken",
					"nextStep": "Select your username"
				},
				"username": {
					"title": "Select your username",
					"word": "Username",
					"invalidUsername": "Username must be between 4 and 15 characters",
					"validUsername": "Username is valid",
					"initialValidation": "Please provide a valid username to check availability",
					"ongoingValidation": "Checking availability...",
					"available": "This username is available",
					"unavailable": "This username is already taken",
					"nextStep": "Select your password"
				},
				"password": {
					"title": "Select your password",
					"word": "Password",
					"wordRepeat": "Repeat password",
					"invalidPassword": "Password must be at least 8 characters long",
					"validPassword": "Minimum length fulfilled",
					"passwordsDontMatch": "Passwords don't match",
					"passwordsMatch": "Passwords match",
					"nextStep": "Register"
				},
				"token": {
					"title": "Confirm your email",
					"description": "Please enter the token you received via email!",
					"initialValidation": "Enter the token to start validation",
					"ongoingValidation": "Validating...",
					"correctToken": "Token is correct",
					"incorrectToken": "Token is incorrect",
					"receiveCodeMessage": "Didn't receive a code?",
					"resendCode": "Get a new one",
					"alertHeading": "Something went wrong!",
					"alertMessage": "Try again.",
					"successMessage": "The verification was successful!",
					"successAction": "Thank you for trusting Costventures, click on the button on the right to automatically login and navigate to the homepage.",
					"successActionLink": "Login",
					"seconds": "seconds"
				}
			},
			"alreadyRegistered": "Already registered?",
			"alreadyRegisteredAction": "Sign in"
		},
		"signin": {
			"title": "Sign in",
			"componentTitle": "Sign in to your account",
			"password": "Password",
			"forgotPassword": {
				"title": "Forgot your password?",
				"abort": "Abort",
				"steps": {
					"email": {
						"title": "What is your email address?",
						"invalidEmail": "Please provide a valid email",
						"validEmail": "Email is valid",
						"nextStep": "Receive reset code"
					},
					"token": {
						"alertHeading": "Something went wrong!",
						"alertMessage": "Try again",
						"nextStep": "Enter new password"
					},
					"password": {
						"title": "Set new password",
						"alertHeading": "Something went wrong!",
						"alertMessage": "Abort.",
						"nextStep": "Set password"
					}
				}
			},
			"rememberMe": "Remember me",
			"noAccount": "Don't have an account yet?",
			"noAccountAction": "Sign up",
			"submit": "Sign in"
		}
	},
	"sidebar": {
		"homepage": {
			"title": "Homepage",
			"home": "Home"
		},
		"trips": {
			"title": "Trips",
			"trips": "Trips",
			"costs": "Costs",
			"history": "History"
		},
		"account": {
			"title": "Account",
			"profile": "Profile"
		}
	},
	"landingPage": {
		"banner": {
			"catchPhrase": {
				"first": "Travel.",
				"second": "Spend.",
				"third": "Divide."
			}
		},
		"register": {
			"title": "Get started with Costventures today by creating a free account.",
			"button": "Register"
		},
		"features": {
			"redirectMessage": "Learn more",
			"travel": {
				"title": "Travel",
				"description": "Travel the world with your friends and family. Create a trip and invite your friends to join you. Plan your trip together and share the costs."
			},
			"spend": {
				"title": "Spend",
				"description": "Spend your money wisely. Create a budget for your trip and keep track of your expenses. See how much you have spent and how much you have left."
			},
			"divide": {
				"title": "Divide",
				"description": "Divide the costs of your trip. Add your expenses and see how much you owe or how much you are owed. Settle your debts and enjoy your trip."
			}
		},
		"reviews": {
			"aleks": "this is way better than our fitness app",
			"thomas": "this shit good",
			"nico": "I can finally see how broke I am now"
		},
		"stats": {
			"users": "Users",
			"subscribers": "Subscribers",
			"investors": "Investors",
			"team": "Talented Team"
		},
		"contactBox": {
			"title": "Contact us",
			"message": "If you have any questions or suggestions, please tell us. We won't bite. :)",
			"invalidName": "Please enter a valid name (at least 3 characters)",
			"invalidEmail": "Please enter a valid email address (e.g. max@mustermann.de)",
			"label": "Message",
			"placeholder": "Whatever you want to say...",
			"button": "Send"
		}
	}
}
